---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.WallLacksCurve
source: html/6e498416-2051-d14b-ba6f-106e951f809c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.WallLacksCurve Property

Wall does not have both a curve driver and a curve!!!!

## Syntax (C#)
```csharp
public static FailureDefinitionId WallLacksCurve { get; }
```